{"home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_2DperTask_nuclei.save_data": [[45, 84], ["model.get_image_paths", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "numpy.zeros", "skimage.io.imsave", "np.moveaxis.cpu", "np.moveaxis.cpu", "np.moveaxis.cpu", "weight_map.cpu().numpy", "weight_map.cpu"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_image_paths", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset"], ["def", "save_data", "(", "gt", ",", "visuals", ",", "index", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "append_idx", ",", "web_dir", ")", ":", "\n", "\n", "    ", "real_img", "=", "visuals", "[", "'real_B'", "]", "[", "index", "]", "\n", "syn_img", "=", "visuals", "[", "'fake_B'", "]", "[", "index", "]", "\n", "label", "=", "visuals", "[", "'real_A'", "]", "[", "index", "]", "\n", "label_ternary", "=", "label_ternary", "[", "index", "]", "\n", "weight_map", "=", "weight_map", "[", "index", "]", "\n", "\n", "img_path", "=", "model", ".", "get_image_paths", "(", ")", "# get image paths", "\n", "\n", "syn_img", "=", "syn_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "syn_img", "=", "(", "syn_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "syn_img", "=", "syn_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "syn_img", "=", "np", ".", "moveaxis", "(", "syn_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "label", "=", "label", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "label", "=", "(", "label", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "label", "=", "label", ".", "astype", "(", "\"uint8\"", ")", "\n", "label", "=", "np", ".", "moveaxis", "(", "label", ",", "0", ",", "-", "1", ")", "\n", "\n", "real_img", "=", "real_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "real_img", "=", "(", "real_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "real_img", "=", "real_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "real_img", "=", "np", ".", "moveaxis", "(", "real_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "# write to the h5 file", "\n", "file", ".", "create_dataset", "(", "f\"images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "syn_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"labels/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label", ")", "\n", "file", ".", "create_dataset", "(", "f\"real_images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "real_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"label_ternary/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label_ternary", ")", "\n", "file", ".", "create_dataset", "(", "f\"weight_map/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "weight_map", ".", "cpu", "(", ")", ".", "numpy", "(", ")", ")", "\n", "\n", "# save as png image file for better visualization: [label, synthetic image, real image]", "\n", "h", ",", "w", ",", "c", "=", "syn_img", ".", "shape", "\n", "new_img", "=", "np", ".", "zeros", "(", "(", "h", ",", "3", "*", "w", ",", "c", ")", ",", "dtype", "=", "np", ".", "uint8", ")", "\n", "new_img", "[", ":", ",", ":", "w", ",", ":", "]", "=", "label", "\n", "new_img", "[", ":", ",", "w", ":", "2", "*", "w", ",", ":", "]", "=", "syn_img", "\n", "new_img", "[", ":", ",", "2", "*", "w", ":", ",", ":", "]", "=", "real_img", "\n", "io", ".", "imsave", "(", "'{:s}/images/img_D{:d}_{:s}_{:d}_{:d}.png'", ".", "format", "(", "web_dir", ",", "dataset_num", ",", "img_path", "[", "0", "]", ",", "index", ",", "append_idx", ")", ",", "new_img", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_2DperTask_nuclei.launch_test_once": [[86, 96], ["model.test", "model.get_current_visuals", "range", "sys.stdout.flush", "test_TDGAN_2DperTask_nuclei.save_data"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.test", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_current_visuals", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_nuclei.save_data"], ["", "def", "launch_test_once", "(", "dataset_num", ",", "idx", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "web_dir", ")", ":", "\n", "# test again.", "\n", "    ", "model", ".", "test", "(", ")", "# run inference", "\n", "visuals", "=", "model", ".", "get_current_visuals", "(", ")", "# get image results", "\n", "#", "\n", "gt", "=", "visuals", "[", "'real_A'", "]", "\n", "\n", "for", "j", "in", "range", "(", "gt", ".", "shape", "[", "0", "]", ")", ":", "\n", "        ", "sys", ".", "stdout", ".", "flush", "(", ")", "\n", "save_data", "(", "gt", ",", "visuals", ",", "j", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "idx", ",", "web_dir", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_brain.save_brain_data": [[45, 99], ["os.makedirs", "model.get_image_paths", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "numpy.zeros", "numpy.array", "numpy.array", "numpy.array", "numpy.array", "PIL.Image.fromarray", "Image.fromarray.save", "numpy.array", "np.moveaxis.cpu", "np.moveaxis.cpu", "np.moveaxis.cpu", "np.moveaxis.cpu"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_image_paths", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.html.HTML.save"], ["def", "save_brain_data", "(", "gt", ",", "visuals", ",", "index", ",", "model", ",", "file", ",", "dataset_num", ",", "seg_label", ",", "append_idx", ",", "save_dir", ")", ":", "\n", "    ", "os", ".", "makedirs", "(", "save_dir", ",", "exist_ok", "=", "True", ")", "\n", "\n", "real_img", "=", "visuals", "[", "'real_B'", "]", "[", "index", "]", "\n", "syn_img", "=", "visuals", "[", "'fake_B'", "]", "[", "index", "]", "\n", "label", "=", "visuals", "[", "'real_A'", "]", "[", "index", "]", "\n", "seg_label", "=", "seg_label", "[", "index", "]", "\n", "\n", "img_path", "=", "model", ".", "get_image_paths", "(", ")", "# get image paths", "\n", "\n", "syn_img", "=", "syn_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "syn_img", "=", "(", "syn_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "syn_img", "=", "syn_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "syn_img", "=", "np", ".", "moveaxis", "(", "syn_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "label", "=", "label", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "label", "=", "(", "label", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "label", "=", "label", ".", "astype", "(", "\"uint8\"", ")", "\n", "label", "=", "np", ".", "moveaxis", "(", "label", ",", "0", ",", "-", "1", ")", "\n", "\n", "seg_label", "=", "seg_label", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "seg_label", "=", "(", "seg_label", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "seg_label", "=", "seg_label", ".", "astype", "(", "\"uint8\"", ")", "\n", "seg_label", "=", "np", ".", "moveaxis", "(", "seg_label", ",", "0", ",", "-", "1", ")", "\n", "\n", "real_img", "=", "real_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "real_img", "=", "(", "real_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "real_img", "=", "real_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "real_img", "=", "np", ".", "moveaxis", "(", "real_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "# # # for brats, resize back to 240x240", "\n", "# if dataset_num > 0: # brats", "\n", "#     size = (240, 240)", "\n", "#     syn_img = Image.fromarray(syn_img).resize(size)", "\n", "#     label = Image.fromarray(label).resize(size, Image.NEAREST)", "\n", "#     seg_label = Image.fromarray(seg_label).resize(size, Image.NEAREST)", "\n", "#     real_img = Image.fromarray(real_img).resize(size)", "\n", "\n", "# write to the h5 file", "\n", "file", ".", "create_dataset", "(", "f\"images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "syn_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"labels/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label", ")", "\n", "file", ".", "create_dataset", "(", "f\"seg_labels/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "seg_label", ")", "\n", "file", ".", "create_dataset", "(", "f\"real_images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "real_img", ")", "\n", "\n", "# save as png image file for better visualization: [label (with skull), seg_label, synthetic image, real image]", "\n", "h", ",", "w", ",", "c", "=", "np", ".", "array", "(", "syn_img", ")", ".", "shape", "\n", "new_img", "=", "np", ".", "zeros", "(", "(", "h", ",", "4", "*", "w", ",", "c", ")", ",", "dtype", "=", "np", ".", "uint8", ")", "\n", "new_img", "[", ":", ",", ":", "w", ",", ":", "]", "=", "np", ".", "array", "(", "label", ")", "\n", "new_img", "[", ":", ",", "w", ":", "2", "*", "w", ",", ":", "]", "=", "np", ".", "array", "(", "seg_label", ")", "\n", "new_img", "[", ":", ",", "2", "*", "w", ":", "3", "*", "w", ",", ":", "]", "=", "np", ".", "array", "(", "syn_img", ")", "\n", "new_img", "[", ":", ",", "3", "*", "w", ":", ",", ":", "]", "=", "np", ".", "array", "(", "real_img", ")", "\n", "new_img", "=", "Image", ".", "fromarray", "(", "new_img", ")", "\n", "\n", "new_img", ".", "save", "(", "'{:s}/img_D{:d}_{:s}_{:d}_{:d}.png'", ".", "format", "(", "save_dir", ",", "dataset_num", ",", "img_path", "[", "0", "]", ",", "index", ",", "append_idx", ")", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_brain.save_nuclei_data": [[101, 141], ["os.makedirs", "model.get_image_paths", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "numpy.zeros", "skimage.io.imsave", "np.moveaxis.cpu", "np.moveaxis.cpu", "np.moveaxis.cpu", "weight_map.cpu().numpy", "weight_map.cpu"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_image_paths", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset"], ["", "def", "save_nuclei_data", "(", "gt", ",", "visuals", ",", "index", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "append_idx", ",", "save_dir", ")", ":", "\n", "    ", "os", ".", "makedirs", "(", "save_dir", ",", "exist_ok", "=", "True", ")", "\n", "\n", "real_img", "=", "visuals", "[", "'real_B'", "]", "[", "index", "]", "\n", "syn_img", "=", "visuals", "[", "'fake_B'", "]", "[", "index", "]", "\n", "label", "=", "visuals", "[", "'real_A'", "]", "[", "index", "]", "\n", "label_ternary", "=", "label_ternary", "[", "index", "]", "\n", "weight_map", "=", "weight_map", "[", "index", "]", "\n", "\n", "img_path", "=", "model", ".", "get_image_paths", "(", ")", "# get image paths", "\n", "\n", "syn_img", "=", "syn_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "syn_img", "=", "(", "syn_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "syn_img", "=", "syn_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "syn_img", "=", "np", ".", "moveaxis", "(", "syn_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "label", "=", "label", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "label", "=", "(", "label", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "label", "=", "label", ".", "astype", "(", "\"uint8\"", ")", "\n", "label", "=", "np", ".", "moveaxis", "(", "label", ",", "0", ",", "-", "1", ")", "\n", "\n", "real_img", "=", "real_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "real_img", "=", "(", "real_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "real_img", "=", "real_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "real_img", "=", "np", ".", "moveaxis", "(", "real_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "# write to the h5 file", "\n", "file", ".", "create_dataset", "(", "f\"images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "syn_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"labels/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label", ")", "\n", "file", ".", "create_dataset", "(", "f\"real_images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "real_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"label_ternary/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label_ternary", ")", "\n", "file", ".", "create_dataset", "(", "f\"weight_map/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "weight_map", ".", "cpu", "(", ")", ".", "numpy", "(", ")", ")", "\n", "\n", "# save as png image file for better visualization: [label, synthetic image, real image]", "\n", "h", ",", "w", ",", "c", "=", "syn_img", ".", "shape", "\n", "new_img", "=", "np", ".", "zeros", "(", "(", "h", ",", "3", "*", "w", ",", "c", ")", ",", "dtype", "=", "np", ".", "uint8", ")", "\n", "new_img", "[", ":", ",", ":", "w", ",", ":", "]", "=", "label", "\n", "new_img", "[", ":", ",", "w", ":", "2", "*", "w", ",", ":", "]", "=", "syn_img", "\n", "new_img", "[", ":", ",", "2", "*", "w", ":", ",", ":", "]", "=", "real_img", "\n", "io", ".", "imsave", "(", "'{:s}/img_D{:d}_{:s}_{:d}_{:d}.png'", ".", "format", "(", "save_dir", ",", "dataset_num", ",", "img_path", "[", "0", "]", ",", "index", ",", "append_idx", ")", ",", "new_img", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_brain.launch_brain_test_once": [[143, 153], ["model.test", "model.get_current_visuals", "range", "sys.stdout.flush", "test_brain.save_brain_data"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.test", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_current_visuals", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_brain.save_brain_data"], ["", "def", "launch_brain_test_once", "(", "dataset_num", ",", "idx", ",", "model", ",", "file", ",", "seg_label", ",", "save_dir", ")", ":", "\n", "# test again.", "\n", "    ", "model", ".", "test", "(", ")", "# run inference", "\n", "visuals", "=", "model", ".", "get_current_visuals", "(", ")", "# get image results", "\n", "#", "\n", "gt", "=", "visuals", "[", "'real_A'", "]", "\n", "\n", "for", "j", "in", "range", "(", "gt", ".", "shape", "[", "0", "]", ")", ":", "\n", "        ", "sys", ".", "stdout", ".", "flush", "(", ")", "\n", "save_brain_data", "(", "gt", ",", "visuals", ",", "j", ",", "model", ",", "file", ",", "dataset_num", ",", "seg_label", ",", "idx", ",", "save_dir", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_brain.launch_nuclei_test_once": [[155, 165], ["model.test", "model.get_current_visuals", "range", "sys.stdout.flush", "test_brain.save_nuclei_data"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.test", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_current_visuals", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_brain.save_nuclei_data"], ["", "", "def", "launch_nuclei_test_once", "(", "dataset_num", ",", "idx", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "save_dir", ")", ":", "\n", "# test again.", "\n", "    ", "model", ".", "test", "(", ")", "# run inference", "\n", "visuals", "=", "model", ".", "get_current_visuals", "(", ")", "# get image results", "\n", "#", "\n", "gt", "=", "visuals", "[", "'real_A'", "]", "\n", "\n", "for", "j", "in", "range", "(", "gt", ".", "shape", "[", "0", "]", ")", ":", "\n", "        ", "sys", ".", "stdout", ".", "flush", "(", ")", "\n", "save_nuclei_data", "(", "gt", ",", "visuals", ",", "j", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "idx", ",", "save_dir", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_pix2pix_nuclei.save_data": [[45, 84], ["model.get_image_paths", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "numpy.zeros", "skimage.io.imsave", "np.moveaxis.cpu", "np.moveaxis.cpu", "np.moveaxis.cpu", "weight_map.cpu().numpy", "weight_map.cpu"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_image_paths", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset"], ["def", "save_data", "(", "gt", ",", "visuals", ",", "index", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "append_idx", ",", "web_dir", ")", ":", "\n", "\n", "    ", "real_img", "=", "visuals", "[", "'real_B'", "]", "[", "index", "]", "\n", "syn_img", "=", "visuals", "[", "'fake_B'", "]", "[", "index", "]", "\n", "label", "=", "visuals", "[", "'real_A'", "]", "[", "index", "]", "\n", "label_ternary", "=", "label_ternary", "[", "index", "]", "\n", "weight_map", "=", "weight_map", "[", "index", "]", "\n", "\n", "img_path", "=", "model", ".", "get_image_paths", "(", ")", "# get image paths", "\n", "\n", "syn_img", "=", "syn_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "syn_img", "=", "(", "syn_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "syn_img", "=", "syn_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "syn_img", "=", "np", ".", "moveaxis", "(", "syn_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "label", "=", "label", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "label", "=", "(", "label", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "label", "=", "label", ".", "astype", "(", "\"uint8\"", ")", "\n", "label", "=", "np", ".", "moveaxis", "(", "label", ",", "0", ",", "-", "1", ")", "\n", "\n", "real_img", "=", "real_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "real_img", "=", "(", "real_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "real_img", "=", "real_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "real_img", "=", "np", ".", "moveaxis", "(", "real_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "# write to the h5 file", "\n", "file", ".", "create_dataset", "(", "f\"images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "syn_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"labels/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label", ")", "\n", "file", ".", "create_dataset", "(", "f\"real_images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "real_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"label_ternary/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label_ternary", ")", "\n", "file", ".", "create_dataset", "(", "f\"weight_map/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "weight_map", ".", "cpu", "(", ")", ".", "numpy", "(", ")", ")", "\n", "\n", "# save as png image file for better visualization: [label, synthetic image, real image]", "\n", "h", ",", "w", ",", "c", "=", "syn_img", ".", "shape", "\n", "new_img", "=", "np", ".", "zeros", "(", "(", "h", ",", "3", "*", "w", ",", "c", ")", ",", "dtype", "=", "np", ".", "uint8", ")", "\n", "new_img", "[", ":", ",", ":", "w", ",", ":", "]", "=", "label", "\n", "new_img", "[", ":", ",", "w", ":", "2", "*", "w", ",", ":", "]", "=", "syn_img", "\n", "new_img", "[", ":", ",", "2", "*", "w", ":", ",", ":", "]", "=", "real_img", "\n", "io", ".", "imsave", "(", "'{:s}/images/img_D{:d}_{:s}_{:d}_{:d}.png'", ".", "format", "(", "web_dir", ",", "dataset_num", ",", "img_path", "[", "0", "]", ",", "index", ",", "append_idx", ")", ",", "new_img", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_pix2pix_nuclei.launch_test_once": [[86, 96], ["model.test", "model.get_current_visuals", "range", "sys.stdout.flush", "test_pix2pix_nuclei.save_data"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.test", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_current_visuals", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_nuclei.save_data"], ["", "def", "launch_test_once", "(", "dataset_num", ",", "idx", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "web_dir", ")", ":", "\n", "# test again.", "\n", "    ", "model", ".", "test", "(", ")", "# run inference", "\n", "visuals", "=", "model", ".", "get_current_visuals", "(", ")", "# get image results", "\n", "#", "\n", "gt", "=", "visuals", "[", "'real_A'", "]", "\n", "\n", "for", "j", "in", "range", "(", "gt", ".", "shape", "[", "0", "]", ")", ":", "\n", "        ", "sys", ".", "stdout", ".", "flush", "(", ")", "\n", "save_data", "(", "gt", ",", "visuals", ",", "j", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "idx", ",", "web_dir", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_nuclei.save_data": [[45, 84], ["model.get_image_paths", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "np.moveaxis.cpu().numpy", "np.moveaxis.astype", "numpy.moveaxis", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "file.create_dataset", "numpy.zeros", "skimage.io.imsave", "np.moveaxis.cpu", "np.moveaxis.cpu", "np.moveaxis.cpu", "weight_map.cpu().numpy", "weight_map.cpu"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_image_paths", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.data.__init__.create_dataset"], ["def", "save_data", "(", "gt", ",", "visuals", ",", "index", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "append_idx", ",", "web_dir", ")", ":", "\n", "\n", "    ", "real_img", "=", "visuals", "[", "'real_B'", "]", "[", "index", "]", "\n", "syn_img", "=", "visuals", "[", "'fake_B'", "]", "[", "index", "]", "\n", "label", "=", "visuals", "[", "'real_A'", "]", "[", "index", "]", "\n", "label_ternary", "=", "label_ternary", "[", "index", "]", "\n", "weight_map", "=", "weight_map", "[", "index", "]", "\n", "\n", "img_path", "=", "model", ".", "get_image_paths", "(", ")", "# get image paths", "\n", "\n", "syn_img", "=", "syn_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "syn_img", "=", "(", "syn_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "syn_img", "=", "syn_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "syn_img", "=", "np", ".", "moveaxis", "(", "syn_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "label", "=", "label", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "label", "=", "(", "label", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "label", "=", "label", ".", "astype", "(", "\"uint8\"", ")", "\n", "label", "=", "np", ".", "moveaxis", "(", "label", ",", "0", ",", "-", "1", ")", "\n", "\n", "real_img", "=", "real_img", ".", "cpu", "(", ")", ".", "numpy", "(", ")", "\n", "real_img", "=", "(", "real_img", "+", "1", ")", "*", "(", "255", "/", "2", ")", "\n", "real_img", "=", "real_img", ".", "astype", "(", "\"uint8\"", ")", "\n", "real_img", "=", "np", ".", "moveaxis", "(", "real_img", ",", "0", ",", "-", "1", ")", "\n", "\n", "# write to the h5 file", "\n", "file", ".", "create_dataset", "(", "f\"images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "syn_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"labels/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label", ")", "\n", "file", ".", "create_dataset", "(", "f\"real_images/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "real_img", ")", "\n", "file", ".", "create_dataset", "(", "f\"label_ternary/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "label_ternary", ")", "\n", "file", ".", "create_dataset", "(", "f\"weight_map/D{dataset_num}_{img_path[0]}_{index}_{append_idx}\"", ",", "data", "=", "weight_map", ".", "cpu", "(", ")", ".", "numpy", "(", ")", ")", "\n", "\n", "# save as png image file for better visualization: [label, synthetic image, real image]", "\n", "h", ",", "w", ",", "c", "=", "syn_img", ".", "shape", "\n", "new_img", "=", "np", ".", "zeros", "(", "(", "h", ",", "3", "*", "w", ",", "c", ")", ",", "dtype", "=", "np", ".", "uint8", ")", "\n", "new_img", "[", ":", ",", ":", "w", ",", ":", "]", "=", "label", "\n", "new_img", "[", ":", ",", "w", ":", "2", "*", "w", ",", ":", "]", "=", "syn_img", "\n", "new_img", "[", ":", ",", "2", "*", "w", ":", ",", ":", "]", "=", "real_img", "\n", "io", ".", "imsave", "(", "'{:s}/images/img_D{:d}_{:s}_{:d}_{:d}.png'", ".", "format", "(", "web_dir", ",", "dataset_num", ",", "img_path", "[", "0", "]", ",", "index", ",", "append_idx", ")", ",", "new_img", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_nuclei.launch_test_once": [[86, 96], ["model.test", "model.get_current_visuals", "range", "sys.stdout.flush", "test_TDGAN_nuclei.save_data"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.test", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.models.base_model.BaseModel.get_current_visuals", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.test_TDGAN_nuclei.save_data"], ["", "def", "launch_test_once", "(", "dataset_num", ",", "idx", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "web_dir", ")", ":", "\n", "# test again.", "\n", "    ", "model", ".", "test", "(", ")", "# run inference", "\n", "visuals", "=", "model", ".", "get_current_visuals", "(", ")", "# get image results", "\n", "#", "\n", "gt", "=", "visuals", "[", "'real_A'", "]", "\n", "\n", "for", "j", "in", "range", "(", "gt", ".", "shape", "[", "0", "]", ")", ":", "\n", "        ", "sys", ".", "stdout", ".", "flush", "(", ")", "\n", "save_data", "(", "gt", ",", "visuals", ",", "j", ",", "model", ",", "file", ",", "label_ternary", ",", "weight_map", ",", "dataset_num", ",", "idx", ",", "web_dir", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.__init__": [[12, 48], ["parse_config._update_config", "pathlib.Path", "parse_config.ConfigParser.save_dir.mkdir", "parse_config.ConfigParser.log_dir.mkdir", "tmp.utils.write_json", "tmp.logger.setup_logging", "datetime.datetime.datetime.now().strftime", "datetime.datetime.datetime.now"], "methods", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._update_config", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.util.mkdir", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.util.mkdir", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.utils.util.write_json", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.logger.logger.setup_logging"], ["    ", "def", "__init__", "(", "self", ",", "config", ",", "resume", "=", "None", ",", "modification", "=", "None", ",", "run_id", "=", "None", ")", ":", "\n", "        ", "\"\"\"\n        class to parse configuration json file. Handles hyperparameters for training, initializations of modules, checkpoint saving\n        and logging module.\n        :param config: Dict containing configurations, hyperparameters for training. contents of `config.json` file for example.\n        :param resume: String, path to the checkpoint being loaded.\n        :param modification: Dict keychain:value, specifying position values to be replaced from config dict.\n        :param run_id: Unique Identifier for training processes. Used to save checkpoints and training log. Timestamp is being used as default\n        \"\"\"", "\n", "# load config file and apply modification", "\n", "self", ".", "_config", "=", "_update_config", "(", "config", ",", "modification", ")", "\n", "self", ".", "resume", "=", "resume", "\n", "\n", "# set save_dir where trained model and log will be saved.", "\n", "save_dir", "=", "Path", "(", "self", ".", "config", "[", "'trainer'", "]", "[", "'save_dir'", "]", ")", "\n", "\n", "exper_name", "=", "self", ".", "config", "[", "'name'", "]", "\n", "if", "run_id", "is", "None", ":", "# use timestamp as default run-id", "\n", "            ", "run_id", "=", "datetime", ".", "now", "(", ")", ".", "strftime", "(", "r'%m%d_%H%M%S'", ")", "\n", "", "self", ".", "_save_dir", "=", "save_dir", "/", "'models'", "/", "exper_name", "/", "run_id", "\n", "self", ".", "_log_dir", "=", "save_dir", "/", "'log'", "/", "exper_name", "/", "run_id", "\n", "\n", "# make directory for saving checkpoints and log.", "\n", "exist_ok", "=", "run_id", "==", "''", "\n", "self", ".", "save_dir", ".", "mkdir", "(", "parents", "=", "True", ",", "exist_ok", "=", "exist_ok", ")", "\n", "self", ".", "log_dir", ".", "mkdir", "(", "parents", "=", "True", ",", "exist_ok", "=", "exist_ok", ")", "\n", "\n", "# save updated config file to the checkpoint dir", "\n", "write_json", "(", "self", ".", "config", ",", "self", ".", "save_dir", "/", "'config.json'", ")", "\n", "\n", "# configure logging module", "\n", "setup_logging", "(", "self", ".", "log_dir", ")", "\n", "self", ".", "log_levels", "=", "{", "\n", "0", ":", "logging", ".", "WARNING", ",", "\n", "1", ":", "logging", ".", "INFO", ",", "\n", "2", ":", "logging", ".", "DEBUG", "\n", "}", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.from_args": [[50, 79], ["tmp.utils.read_json", "cls", "args.parse_args.parse_args.add_argument", "isinstance", "args.parse_args.parse_args.parse_args", "pathlib.Path", "pathlib.Path", "tmp.utils.read_json.update", "getattr", "tmp.utils.read_json", "parse_config._get_opt_name"], "methods", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.utils.util.read_json", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.utils.util.MetricTracker.update", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.utils.util.read_json", "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._get_opt_name"], ["", "@", "classmethod", "\n", "def", "from_args", "(", "cls", ",", "args", ",", "options", "=", "''", ")", ":", "\n", "        ", "\"\"\"\n        Initialize this class from some cli arguments. Used in train, test.\n        \"\"\"", "\n", "for", "opt", "in", "options", ":", "\n", "            ", "args", ".", "add_argument", "(", "*", "opt", ".", "flags", ",", "default", "=", "None", ",", "type", "=", "opt", ".", "type", ")", "\n", "", "if", "not", "isinstance", "(", "args", ",", "tuple", ")", ":", "\n", "            ", "args", "=", "args", ".", "parse_args", "(", ")", "\n", "\n", "", "if", "args", ".", "device", "is", "not", "None", ":", "\n", "            ", "os", ".", "environ", "[", "\"CUDA_VISIBLE_DEVICES\"", "]", "=", "args", ".", "device", "\n", "", "if", "args", ".", "resume", "is", "not", "None", ":", "\n", "            ", "resume", "=", "Path", "(", "args", ".", "resume", ")", "\n", "cfg_fname", "=", "resume", ".", "parent", "/", "'config.json'", "\n", "", "else", ":", "\n", "            ", "msg_no_cfg", "=", "\"Configuration file need to be specified. Add '-c config.json', for example.\"", "\n", "assert", "args", ".", "config", "is", "not", "None", ",", "msg_no_cfg", "\n", "resume", "=", "None", "\n", "cfg_fname", "=", "Path", "(", "args", ".", "config", ")", "\n", "\n", "", "config", "=", "read_json", "(", "cfg_fname", ")", "\n", "if", "args", ".", "config", "and", "resume", ":", "\n", "# update new config for fine-tuning", "\n", "            ", "config", ".", "update", "(", "read_json", "(", "args", ".", "config", ")", ")", "\n", "\n", "# parse custom cli options into dictionary", "\n", "", "modification", "=", "{", "opt", ".", "target", ":", "getattr", "(", "args", ",", "_get_opt_name", "(", "opt", ".", "flags", ")", ")", "for", "opt", "in", "options", "}", "\n", "return", "cls", "(", "config", ",", "resume", ",", "modification", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.init_obj": [[80, 94], ["dict", "all", "dict.update", "getattr"], "methods", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.utils.util.MetricTracker.update"], ["", "def", "init_obj", "(", "self", ",", "name", ",", "module", ",", "*", "args", ",", "**", "kwargs", ")", ":", "\n", "        ", "\"\"\"\n        Finds a function handle with the name given as 'type' in config, and returns the\n        instance initialized with corresponding arguments given.\n\n        `object = config.init_obj('name', module, a, b=1)`\n        is equivalent to\n        `object = module.name(a, b=1)`\n        \"\"\"", "\n", "module_name", "=", "self", "[", "name", "]", "[", "'type'", "]", "\n", "module_args", "=", "dict", "(", "self", "[", "name", "]", "[", "'args'", "]", ")", "\n", "assert", "all", "(", "[", "k", "not", "in", "module_args", "for", "k", "in", "kwargs", "]", ")", ",", "'Overwriting kwargs given in config file is not allowed'", "\n", "module_args", ".", "update", "(", "kwargs", ")", "\n", "return", "getattr", "(", "module", ",", "module_name", ")", "(", "*", "args", ",", "**", "module_args", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.init_ftn": [[95, 109], ["dict", "all", "dict.update", "functools.partial", "getattr"], "methods", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.utils.util.MetricTracker.update"], ["", "def", "init_ftn", "(", "self", ",", "name", ",", "module", ",", "*", "args", ",", "**", "kwargs", ")", ":", "\n", "        ", "\"\"\"\n        Finds a function handle with the name given as 'type' in config, and returns the\n        function with given arguments fixed with functools.partial.\n\n        `function = config.init_ftn('name', module, a, b=1)`\n        is equivalent to\n        `function = lambda *args, **kwargs: module.name(a, *args, b=1, **kwargs)`.\n        \"\"\"", "\n", "module_name", "=", "self", "[", "name", "]", "[", "'type'", "]", "\n", "module_args", "=", "dict", "(", "self", "[", "name", "]", "[", "'args'", "]", ")", "\n", "assert", "all", "(", "[", "k", "not", "in", "module_args", "for", "k", "in", "kwargs", "]", ")", ",", "'Overwriting kwargs given in config file is not allowed'", "\n", "module_args", ".", "update", "(", "kwargs", ")", "\n", "return", "partial", "(", "getattr", "(", "module", ",", "module_name", ")", ",", "*", "args", ",", "**", "module_args", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.__getitem__": [[110, 113], ["None"], "methods", ["None"], ["", "def", "__getitem__", "(", "self", ",", "name", ")", ":", "\n", "        ", "\"\"\"Access items like ordinary dict.\"\"\"", "\n", "return", "self", ".", "config", "[", "name", "]", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.get_logger": [[114, 120], ["logging.getLogger", "logging.getLogger.setLevel", "parse_config.ConfigParser.log_levels.keys"], "methods", ["None"], ["", "def", "get_logger", "(", "self", ",", "name", ",", "verbosity", "=", "2", ")", ":", "\n", "        ", "msg_verbosity", "=", "'verbosity option {} is invalid. Valid options are {}.'", ".", "format", "(", "verbosity", ",", "self", ".", "log_levels", ".", "keys", "(", ")", ")", "\n", "assert", "verbosity", "in", "self", ".", "log_levels", ",", "msg_verbosity", "\n", "logger", "=", "logging", ".", "getLogger", "(", "name", ")", "\n", "logger", ".", "setLevel", "(", "self", ".", "log_levels", "[", "verbosity", "]", ")", "\n", "return", "logger", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.config": [[122, 125], ["None"], "methods", ["None"], ["", "@", "property", "\n", "def", "config", "(", "self", ")", ":", "\n", "        ", "return", "self", ".", "_config", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.save_dir": [[126, 129], ["None"], "methods", ["None"], ["", "@", "property", "\n", "def", "save_dir", "(", "self", ")", ":", "\n", "        ", "return", "self", ".", "_save_dir", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config.ConfigParser.log_dir": [[130, 133], ["None"], "methods", ["None"], ["", "@", "property", "\n", "def", "log_dir", "(", "self", ")", ":", "\n", "        ", "return", "self", ".", "_log_dir", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._update_config": [[135, 143], ["modification.items", "parse_config._set_by_path"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._set_by_path"], ["", "", "def", "_update_config", "(", "config", ",", "modification", ")", ":", "\n", "    ", "if", "modification", "is", "None", ":", "\n", "        ", "return", "config", "\n", "\n", "", "for", "k", ",", "v", "in", "modification", ".", "items", "(", ")", ":", "\n", "        ", "if", "v", "is", "not", "None", ":", "\n", "            ", "_set_by_path", "(", "config", ",", "k", ",", "v", ")", "\n", "", "", "return", "config", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._get_opt_name": [[144, 149], ["flags[].replace", "flg.startswith", "flg.replace"], "function", ["None"], ["", "def", "_get_opt_name", "(", "flags", ")", ":", "\n", "    ", "for", "flg", "in", "flags", ":", "\n", "        ", "if", "flg", ".", "startswith", "(", "'--'", ")", ":", "\n", "            ", "return", "flg", ".", "replace", "(", "'--'", ",", "''", ")", "\n", "", "", "return", "flags", "[", "0", "]", ".", "replace", "(", "'--'", ",", "''", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._set_by_path": [[150, 154], ["keys.split.split", "parse_config._get_by_path"], "function", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._get_by_path"], ["", "def", "_set_by_path", "(", "tree", ",", "keys", ",", "value", ")", ":", "\n", "    ", "\"\"\"Set a value in a nested object in tree by sequence of keys.\"\"\"", "\n", "keys", "=", "keys", ".", "split", "(", "';'", ")", "\n", "_get_by_path", "(", "tree", ",", "keys", "[", ":", "-", "1", "]", ")", "[", "keys", "[", "-", "1", "]", "]", "=", "value", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.None.parse_config._get_by_path": [[155, 158], ["functools.reduce"], "function", ["None"], ["", "def", "_get_by_path", "(", "tree", ",", "keys", ")", ":", "\n", "    ", "\"\"\"Access a nested object in tree by sequence of keys.\"\"\"", "\n", "return", "reduce", "(", "getitem", ",", "keys", ",", "tree", ")", "\n", "", ""]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.html.HTML.__init__": [[14, 34], ["os.path.join", "dominate.document", "os.path.exists", "os.makedirs", "os.path.exists", "os.makedirs", "dominate.tags.meta", "str"], "methods", ["None"], ["def", "__init__", "(", "self", ",", "web_dir", ",", "title", ",", "refresh", "=", "0", ")", ":", "\n", "        ", "\"\"\"Initialize the HTML classes\n\n        Parameters:\n            web_dir (str) -- a directory that stores the webpage. HTML file will be created at <web_dir>/index.html; images will be saved at <web_dir/images/\n            title (str)   -- the webpage name\n            refresh (int) -- how often the website refresh itself; if 0; no refreshing\n        \"\"\"", "\n", "self", ".", "title", "=", "title", "\n", "self", ".", "web_dir", "=", "web_dir", "\n", "self", ".", "img_dir", "=", "os", ".", "path", ".", "join", "(", "self", ".", "web_dir", ",", "'images'", ")", "\n", "if", "not", "os", ".", "path", ".", "exists", "(", "self", ".", "web_dir", ")", ":", "\n", "            ", "os", ".", "makedirs", "(", "self", ".", "web_dir", ")", "\n", "", "if", "not", "os", ".", "path", ".", "exists", "(", "self", ".", "img_dir", ")", ":", "\n", "            ", "os", ".", "makedirs", "(", "self", ".", "img_dir", ")", "\n", "\n", "", "self", ".", "doc", "=", "dominate", ".", "document", "(", "title", "=", "title", ")", "\n", "if", "refresh", ">", "0", ":", "\n", "            ", "with", "self", ".", "doc", ".", "head", ":", "\n", "                ", "meta", "(", "http_equiv", "=", "\"refresh\"", ",", "content", "=", "str", "(", "refresh", ")", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.html.HTML.get_image_dir": [[35, 38], ["None"], "methods", ["None"], ["", "", "", "def", "get_image_dir", "(", "self", ")", ":", "\n", "        ", "\"\"\"Return the directory that stores images\"\"\"", "\n", "return", "self", ".", "img_dir", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.html.HTML.add_header": [[39, 47], ["dominate.tags.h3"], "methods", ["None"], ["", "def", "add_header", "(", "self", ",", "text", ")", ":", "\n", "        ", "\"\"\"Insert a header to the HTML file\n\n        Parameters:\n            text (str) -- the header text\n        \"\"\"", "\n", "with", "self", ".", "doc", ":", "\n", "            ", "h3", "(", "text", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.html.HTML.add_images": [[48, 67], ["dominate.tags.table", "html.HTML.doc.add", "dominate.tags.tr", "zip", "dominate.tags.td", "dominate.tags.p", "dominate.tags.br", "dominate.tags.p", "dominate.tags.a", "dominate.tags.img", "os.path.join", "os.path.join"], "methods", ["None"], ["", "", "def", "add_images", "(", "self", ",", "ims", ",", "txts", ",", "links", ",", "width", "=", "400", ")", ":", "\n", "        ", "\"\"\"add images to the HTML file\n\n        Parameters:\n            ims (str list)   -- a list of image paths\n            txts (str list)  -- a list of image names shown on the website\n            links (str list) --  a list of hyperref links; when you click an image, it will redirect you to a new page\n        \"\"\"", "\n", "self", ".", "t", "=", "table", "(", "border", "=", "1", ",", "style", "=", "\"table-layout: fixed;\"", ")", "# Insert a table", "\n", "self", ".", "doc", ".", "add", "(", "self", ".", "t", ")", "\n", "with", "self", ".", "t", ":", "\n", "            ", "with", "tr", "(", ")", ":", "\n", "                ", "for", "im", ",", "txt", ",", "link", "in", "zip", "(", "ims", ",", "txts", ",", "links", ")", ":", "\n", "                    ", "with", "td", "(", "style", "=", "\"word-wrap: break-word;\"", ",", "halign", "=", "\"center\"", ",", "valign", "=", "\"top\"", ")", ":", "\n", "                        ", "with", "p", "(", ")", ":", "\n", "                            ", "with", "a", "(", "href", "=", "os", ".", "path", ".", "join", "(", "'images'", ",", "link", ")", ")", ":", "\n", "                                ", "img", "(", "style", "=", "\"width:%dpx\"", "%", "width", ",", "src", "=", "os", ".", "path", ".", "join", "(", "'images'", ",", "im", ")", ")", "\n", "", "br", "(", ")", "\n", "p", "(", "txt", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.html.HTML.save": [[68, 74], ["open", "open.write", "open.close", "html.HTML.doc.render"], "methods", ["None"], ["", "", "", "", "", "", "def", "save", "(", "self", ")", ":", "\n", "        ", "\"\"\"save the current content to the HMTL file\"\"\"", "\n", "html_file", "=", "'%s/index.html'", "%", "self", ".", "web_dir", "\n", "f", "=", "open", "(", "html_file", ",", "'wt'", ")", "\n", "f", ".", "write", "(", "self", ".", "doc", ".", "render", "(", ")", ")", "\n", "f", ".", "close", "(", ")", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.image_pool.ImagePool.__init__": [[12, 22], ["None"], "methods", ["None"], ["def", "__init__", "(", "self", ",", "pool_size", ")", ":", "\n", "        ", "\"\"\"Initialize the ImagePool class\n\n        Parameters:\n            pool_size (int) -- the size of image buffer, if pool_size=0, no buffer will be created\n        \"\"\"", "\n", "self", ".", "pool_size", "=", "pool_size", "\n", "if", "self", ".", "pool_size", ">", "0", ":", "# create an empty pool", "\n", "            ", "self", ".", "num_imgs", "=", "0", "\n", "self", ".", "images", "=", "[", "]", "\n", "\n"]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.image_pool.ImagePool.query": [[23, 55], ["torch.cat", "torch.unsqueeze", "image_pool.ImagePool.images.append", "torch.cat.append", "random.uniform", "random.randint", "image_pool.ImagePool.images[].clone", "torch.cat.append", "torch.cat.append"], "methods", ["None"], ["", "", "def", "query", "(", "self", ",", "images", ")", ":", "\n", "        ", "\"\"\"Return an image from the pool.\n\n        Parameters:\n            images: the latest generated images from the generator\n\n        Returns images from the buffer.\n\n        By 50/100, the buffer will return input images.\n        By 50/100, the buffer will return images previously stored in the buffer,\n        and insert the current images to the buffer.\n        \"\"\"", "\n", "if", "self", ".", "pool_size", "==", "0", ":", "# if the buffer size is 0, do nothing", "\n", "            ", "return", "images", "\n", "", "return_images", "=", "[", "]", "\n", "for", "image", "in", "images", ":", "\n", "            ", "image", "=", "torch", ".", "unsqueeze", "(", "image", ".", "data", ",", "0", ")", "\n", "if", "self", ".", "num_imgs", "<", "self", ".", "pool_size", ":", "# if the buffer is not full; keep inserting current images to the buffer", "\n", "                ", "self", ".", "num_imgs", "=", "self", ".", "num_imgs", "+", "1", "\n", "self", ".", "images", ".", "append", "(", "image", ")", "\n", "return_images", ".", "append", "(", "image", ")", "\n", "", "else", ":", "\n", "                ", "p", "=", "random", ".", "uniform", "(", "0", ",", "1", ")", "\n", "if", "p", ">", "0.5", ":", "# by 50% chance, the buffer will return a previously stored image, and insert the current image into the buffer", "\n", "                    ", "random_id", "=", "random", ".", "randint", "(", "0", ",", "self", ".", "pool_size", "-", "1", ")", "# randint is inclusive", "\n", "tmp", "=", "self", ".", "images", "[", "random_id", "]", ".", "clone", "(", ")", "\n", "self", ".", "images", "[", "random_id", "]", "=", "image", "\n", "return_images", ".", "append", "(", "tmp", ")", "\n", "", "else", ":", "# by another 50% chance, the buffer will return the current image", "\n", "                    ", "return_images", ".", "append", "(", "image", ")", "\n", "", "", "", "return_images", "=", "torch", ".", "cat", "(", "return_images", ",", "0", ")", "# collect all the images and return", "\n", "return", "return_images", "\n", "", "", ""]], "home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.visualizer.Visualizer.__init__": [[52, 86], ["os.path.join", "visdom.Visdom", "os.path.join", "os.path.join", "print", "util.mkdirs", "open", "time.strftime", "log_file.write", "visualizer.Visualizer.vis.check_connection", "visualizer.Visualizer.create_visdom_connections"], "methods", ["home.repos.pwc.inspect_result.huiqu18_TDGAN-PyTorch.util.util.mkdirs", 